In [2]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.master("local[1]") \
    .appName("SparkByExamples.com").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/01/31 15:14:53 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/01/31 15:14:54 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [4]:
df = spark.read.csv('./week4/titanic.csv',header=True, inferSchema = True)

In [5]:
df.show(2, truncate=False)

+-----------+--------+------+---------------------------------------------------+------+----+-----+-----+---------+-------+-----+--------+
|PassengerId|Survived|Pclass|Name                                               |Sex   |Age |SibSp|Parch|Ticket   |Fare   |Cabin|Embarked|
+-----------+--------+------+---------------------------------------------------+------+----+-----+-----+---------+-------+-----+--------+
|1          |0       |3     |Braund, Mr. Owen Harris                            |male  |22.0|1    |0    |A/5 21171|7.25   |null |S       |
|2          |1       |1     |Cumings, Mrs. John Bradley (Florence Briggs Thayer)|female|38.0|1    |0    |PC 17599 |71.2833|C85  |C       |
+-----------+--------+------+---------------------------------------------------+------+----+-----+-----+---------+-------+-----+--------+
only showing top 2 rows

In [6]:
df.select(['age', 'sex','survived']).show(2)

+----+------+--------+
| age|   sex|survived|
+----+------+--------+
|22.0|  male|       0|
|38.0|female|       1|
+----+------+--------+
only showing top 2 rows

In [14]:
df.filter(df["age"] > 60).show(5)

+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name| Sex| Age|SibSp|Parch|    Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
|         34|       0|     2|Wheadon, Mr. Edwa...|male|66.0|    0|    0|C.A. 24579|   10.5| null|       S|
|         55|       0|     1|Ostby, Mr. Engelh...|male|65.0|    0|    1|    113509|61.9792|  B30|       C|
|         97|       0|     1|Goldschmidt, Mr. ...|male|71.0|    0|    0|  PC 17754|34.6542|   A5|       C|
|        117|       0|     3|Connors, Mr. Patrick|male|70.5|    0|    0|    370369|   7.75| null|       Q|
|        171|       0|     1|Van der hoef, Mr....|male|61.0|    0|    0|    111240|   33.5|  B19|       S|
+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
only showing top 5 rows

In [20]:
df.filter(df["Name"].isNull()).count()

0

In [23]:
df.filter(df["age"].isNotNull()).show(10)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

In [25]:
## checking if how many null values are there in each column
from pyspark.sql.functions import col, isnan, when, count

df.select([count(when(isnan(c) | col(c).isNull(), c)).alias(c) for c in df.columns]).show()

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|          0|       0|     0|   0|  0|177|    0|    0|     0|   0|  687|       2|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

In [26]:
df.select(['Embarked']).distinct().show()

+--------+
|Embarked|
+--------+
|       Q|
|    null|
|       C|
|       S|
+--------+

In [28]:
df.select(["sex"]).distinct().show()

+------+
|   sex|
+------+
|female|
|  male|
+------+

In [30]:
df.head(5)

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S')]

In [31]:
df.groupBy(['Embarked']).count().show()

+--------+-----+
|Embarked|count|
+--------+-----+
|       Q|   77|
|    null|    2|
|       C|  168|
|       S|  644|
+--------+-----+

In [36]:
embarked_lst = df.select(['Embarked']).rdd.flatMap(lambda x:x).collect()

In [39]:
embarked_lst[:5]

['S', 'C', 'S', 'S', 'S']

In [42]:
df.select(['embarked','age']).rdd.flatMap(lambda x:x).take(10)

['S', 22.0, 'C', 38.0, 'S', 26.0, 'S', 35.0, 'S', 35.0]

In [49]:
funct = lambda x, y: {x:y}

In [50]:
df.select(['embarked','age']).rdd.map(lambda x: funct(x[0], x[1])).take(10)

[{'S': 22.0},
 {'C': 38.0},
 {'S': 26.0},
 {'S': 35.0},
 {'S': 35.0},
 {'Q': None},
 {'S': 54.0},
 {'S': 2.0},
 {'S': 27.0},
 {'C': 14.0}]

In [48]:
df.groupBy(['Embarked']).agg({'age':'mean'}).show()

+--------+------------------+
|Embarked|          avg(age)|
+--------+------------------+
|       Q|28.089285714285715|
|    null|              50.0|
|       C| 30.81476923076923|
|       S| 29.44539711191336|
+--------+------------------+

In [53]:
import pandas as pd
dff = pd.read_csv('./week4/titanic.csv')

In [54]:
dff.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
dff["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [64]:
a = dff.groupby(['Embarked']).count()

In [65]:
a

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,168,168,168,168,168,130,168,168,168,168,69
Q,77,77,77,77,77,28,77,77,77,77,4
S,644,644,644,644,644,554,644,644,644,644,129

In [67]:
df.head(5)

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S')]

In [71]:
from pyspark.sql.functions import mean, min, max
a = ['age','sex', 'ticket']

for i in a:
    
    a = df.select([mean(i), min(i), max(i)]).show()
    a

+-----------------+--------+--------+
|         avg(age)|min(age)|max(age)|
+-----------------+--------+--------+
|29.69911764705882|    0.42|    80.0|
+-----------------+--------+--------+

+--------+--------+--------+
|avg(sex)|min(sex)|max(sex)|
+--------+--------+--------+
|    null|  female|    male|
+--------+--------+--------+

+------------------+-----------+-----------+
|       avg(ticket)|min(ticket)|max(ticket)|
+------------------+-----------+-----------+
|260318.54916792738|     110152|  WE/P 5735|
+------------------+-----------+-----------+

In [77]:
df.select(['age', 'sex']).groupBy('sex').agg({'age':'mean'}).show()

+------+------------------+
|   sex|          avg(age)|
+------+------------------+
|female|27.915708812260537|
|  male| 30.72664459161148|
+------+------------------+

In [78]:
df.crosstab('sex', 'survived').show()

+------------+---+---+
|sex_survived|  0|  1|
+------------+---+---+
|        male|468|109|
|      female| 81|233|
+------------+---+---+

In [79]:
df.crosstab('sex', 'Embarked').show()

+------------+---+---+---+----+
|sex_Embarked|  C|  Q|  S|null|
+------------+---+---+---+----+
|        male| 95| 41|441|   0|
|      female| 73| 36|203|   2|
+------------+---+---+---+----+

In [80]:
df.crosstab('survived', 'sex').show()

+------------+------+----+
|survived_sex|female|male|
+------------+------+----+
|           0|    81| 468|
|           1|   233| 109|
+------------+------+----+

In [81]:
df.filter(df['age']<= 20).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-------------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|       Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-------------+-------+-----------+--------+
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|       349909| 21.075|       null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|       237736|30.0708|       null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|      PP 9549|   16.7|         G6|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|    A/5. 2151|   8.05|       null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|       350406| 7.8542|       null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|       382652| 29.125|       null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|       330923| 8.0292|       null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|       349909| 21.075|       null|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|        19950|  263.0|C23 C25 C27|       S|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|       345764|   18.0|       null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|         2651|11.2417|       null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|SC/Paris 2123|41.5792|       null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|       330958| 7.8792|       null|       Q|
|         50|       0|     3|Arnold-Franchi, M...|female|18.0|    1|    0|       349237|   17.8|       null|       S|
|         51|       0|     3|Panula, Master. J...|  male| 7.0|    4|    1|      3101295|39.6875|       null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|   C.A. 34651|  27.75|       null|       S|
|         60|       0|     3|Goodwin, Master. ...|  male|11.0|    5|    2|      CA 2144|   46.9|       null|       S|
|         64|       0|     3|Skoog, Master. Ha...|  male| 4.0|    3|    2|       347088|   27.9|       null|       S|
|         68|       0|     3|Crease, Mr. Ernes...|  male|19.0|    0|    0|    S.P. 3464| 8.1583|       null|       S|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|      3101281|  7.925|       null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-------------+-------+-----------+--------+
only showing top 20 rows

In [87]:
## filtering passengers who were male and below the age of 20
a = df['age'] < 20 
b = df['sex'] == 'male'
df.filter(a & b).show()

+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name| Sex| Age|SibSp|Parch|    Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----------+--------+
|          8|       0|     3|Palsson, Master. ...|male| 2.0|    3|    1|    349909| 21.075|       null|       S|
|         17|       0|     3|Rice, Master. Eugene|male| 2.0|    4|    1|    382652| 29.125|       null|       Q|
|         28|       0|     1|Fortune, Mr. Char...|male|19.0|    3|    2|     19950|  263.0|C23 C25 C27|       S|
|         51|       0|     3|Panula, Master. J...|male| 7.0|    4|    1|   3101295|39.6875|       null|       S|
|         60|       0|     3|Goodwin, Master. ...|male|11.0|    5|    2|   CA 2144|   46.9|       null|       S|
|         64|       0|     3|Skoog, Master. Ha...|male| 4.0|    3|    2|    347088|   27.9|       null|       S|
|         68|       0|     3|Crease, Mr. Ernes...|male|19.0|    0|    0| S.P. 3464| 8.1583|       null|       S|
|         79|       1|     2|Caldwell, Master....|male|0.83|    0|    2|    248738|   29.0|       null|       S|
|         87|       0|     3|Ford, Mr. William...|male|16.0|    1|    3|W./C. 6608| 34.375|       null|       S|
|        126|       1|     3|Nicola-Yarred, Ma...|male|12.0|    1|    0|      2651|11.2417|       null|       C|
|        139|       0|     3| Osen, Mr. Olaf Elon|male|16.0|    0|    0|      7534| 9.2167|       null|       S|
|        144|       0|     3| Burke, Mr. Jeremiah|male|19.0|    0|    0|    365222|   6.75|       null|       Q|
|        145|       0|     2|Andrew, Mr. Edgar...|male|18.0|    0|    0|    231945|   11.5|       null|       S|
|        146|       0|     2|Nicholls, Mr. Jos...|male|19.0|    1|    1|C.A. 33112|  36.75|       null|       S|
|        164|       0|     3|     Calic, Mr. Jovo|male|17.0|    0|    0|    315093| 8.6625|       null|       S|
|        165|       0|     3|Panula, Master. E...|male| 1.0|    4|    1|   3101295|39.6875|       null|       S|
|        166|       1|     3|"Goldsmith, Maste...|male| 9.0|    0|    2|    363291| 20.525|       null|       S|
|        172|       0|     3|Rice, Master. Arthur|male| 4.0|    4|    1|    382652| 29.125|       null|       Q|
|        176|       0|     3|Klasen, Mr. Klas ...|male|18.0|    1|    1|    350404| 7.8542|       null|       S|
|        183|       0|     3|Asplund, Master. ...|male| 9.0|    4|    2|    347077|31.3875|       null|       S|
+-----------+--------+------+--------------------+----+----+-----+-----+----------+-------+-----------+--------+
only showing top 20 rows

In [91]:
df.filter((df['age'] > 20) & (df['age']< 30) & (df['survived'] == 1) & (df['sex'] == 'male')).show()

+-----------+--------+------+--------------------+----+----+-----+-----+--------+-------+-------+--------+
|PassengerId|Survived|Pclass|                Name| Sex| Age|SibSp|Parch|  Ticket|   Fare|  Cabin|Embarked|
+-----------+--------+------+--------------------+----+----+-----+-----+--------+-------+-------+--------+
|         24|       1|     1|Sloper, Mr. Willi...|male|28.0|    0|    0|  113788|   35.5|     A6|       S|
|         82|       1|     3|Sheerlinck, Mr. J...|male|29.0|    0|    0|  345779|    9.5|   null|       S|
|         98|       1|     1|Greenfield, Mr. W...|male|23.0|    0|    1|PC 17759|63.3583|D10 D12|       C|
|        128|       1|     3|Madsen, Mr. Fridt...|male|24.0|    0|    0| C 17369| 7.1417|   null|       S|
|        147|       1|     3|"Andersson, Mr. A...|male|27.0|    0|    0|  350043| 7.7958|   null|       S|
|        208|       1|     3|Albimona, Mr. Nas...|male|26.0|    0|    0|    2699|18.7875|   null|       C|
|        268|       1|     3|Persson, Mr. Erns...|male|25.0|    1|    0|  347083|  7.775|   null|       S|
|        272|       1|     3|Tornquist, Mr. Wi...|male|25.0|    0|    0|    LINE|    0.0|   null|       S|
|        371|       1|     1|Harder, Mr. Georg...|male|25.0|    1|    0|   11765|55.4417|    E50|       C|
|        392|       1|     3|Jansson, Mr. Carl...|male|21.0|    0|    0|  350034| 7.7958|   null|       S|
|        431|       1|     1|Bjornstrom-Steffa...|male|28.0|    0|    0|  110564|  26.55|    C52|       S|
|        456|       1|     3|  Jalsevac, Mr. Ivan|male|29.0|    0|    0|  349240| 7.8958|   null|       C|
|        485|       1|     1|Bishop, Mr. Dicki...|male|25.0|    1|    0|   11967|91.0792|    B49|       C|
|        510|       1|     3|      Lang, Mr. Fang|male|26.0|    0|    0|    1601|56.4958|   null|       S|
|        511|       1|     3|Daly, Mr. Eugene ...|male|29.0|    0|    0|  382651|   7.75|   null|       Q|
|        554|       1|     3|"Leeni, Mr. Fahim...|male|22.0|    0|    0|    2620|  7.225|   null|       C|
|        608|       1|     1|Daniel, Mr. Rober...|male|27.0|    0|    0|  113804|   30.5|   null|       S|
|        682|       1|     1|  Hassab, Mr. Hammad|male|27.0|    0|    0|PC 17572|76.7292|    D49|       C|
|        725|       1|     1|Chambers, Mr. Nor...|male|27.0|    1|    0|  113806|   53.1|     E8|       S|
|        805|       1|     3|Hedman, Mr. Oskar...|male|27.0|    0|    0|  347089|  6.975|   null|       S|
+-----------+--------+------+--------------------+----+----+-----+-----+--------+-------+-------+--------+
only showing top 20 rows

In [92]:
df.filter(df['Embarked'] == 'C').groupBy('sex').agg({'age':'mean'}).show()

+------+-----------------+
|   sex|         avg(age)|
+------+-----------------+
|female|28.34426229508197|
|  male|32.99884057971015|
+------+-----------------+

In [93]:
df.groupBy('sex').agg({'age':'mean'}).show()

+------+------------------+
|   sex|          avg(age)|
+------+------------------+
|female|27.915708812260537|
|  male| 30.72664459161148|
+------+------------------+

In [96]:
df.select(['age', 'sex', 'Name', 'survived']).filter((df['age'] > 20) & (df['survived'] == 1)).orderBy('age', ascending = False).show()

+----+------+--------------------+--------+
| age|   sex|                Name|survived|
+----+------+--------------------+--------+
|80.0|  male|Barkworth, Mr. Al...|       1|
|63.0|female|Turkula, Mrs. (He...|       1|
|63.0|female|Andrews, Miss. Ko...|       1|
|62.0|  male|  Harris, Mr. George|       1|
|62.0|female|Stone, Mrs. Georg...|       1|
|60.0|female|Warren, Mrs. Fran...|       1|
|60.0|  male|Frolicher-Stehli,...|       1|
|58.0|female|Lurette, Miss. Elise|       1|
|58.0|female|Bonnell, Miss. El...|       1|
|58.0|female|Graham, Mrs. Will...|       1|
|56.0|female|Potter, Mrs. Thom...|       1|
|56.0|  male|Simonius-Blumer, ...|       1|
|55.0|female|Hewlett, Mrs. (Ma...|       1|
|54.0|female|Rothschild, Mrs. ...|       1|
|54.0|female|Eustis, Miss. Eli...|       1|
|54.0|female|Hocking, Mrs. Eli...|       1|
|53.0|female|Appleton, Mrs. Ed...|       1|
|52.0|  male|Peuchen, Major. A...|       1|
|52.0|female|Stephenson, Mrs. ...|       1|
|52.0|female|Hays, Mrs. Charle...|       1|
+----+------+--------------------+--------+
only showing top 20 rows

In [101]:
## remove nan values from the age column and then sort the values in ascending order

df = df.filter(df['age'].isNotNull())

In [103]:
df.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [106]:
df.filter((df['sex'] == 'female') & (df['survived'] == 1)).count()

197

In [110]:
df.filter(df['sex'] ==  'female').count()

261

In [111]:
197/261

0.7547892720306514

23/01/31 17:25:19 WARN HeartbeatReceiver: Removing executor driver with no recent heartbeats: 1065044 ms exceeds timeout 120000 ms
23/01/31 17:25:19 WARN SparkContext: Killing executors is not supported by current scheduler.

In [114]:
a = df.select(['sex']).show(5)

+------+
|   sex|
+------+
|  male|
|female|
|female|
|female|
|  male|
+------+
only showing top 5 rows

TypeError: 'NoneType' object is not iterable